misaka23300/STC15-lanqiao_code/参考项目/来源b站up主Sky少年y/11-AT24C02的基础操作/iic.c
/**
 * @file iic.c
 * @brief I2C总线驱动文件
 * @date 2026 - 6 - 9
 * @version 1.0
 */

/*	#   I2C代码片段说明
	1. 	本文件夹中提供的驱动代码供参赛选手完成程序设计参考。
	2. 	参赛选手可以自行编写相关代码或以该代码为基础，根据所选单片机类型、运行速度和试题
		中对单片机时钟频率的要求，进行代码调试和修改。
*/
#include <STC15F2K60S2.H>
#include "intrins.h"
#define DELAY_TIME	10

sbit scl = 2^0;
sbit sda = 2^1;

//
static void I2C_Delay( unsigned char n )
{
    do
    {
        _nop_();_nop_();_nop_();_nop_();_nop_();
        _nop_();_nop_();_nop_();_nop_();_nop_();
        _nop_();_nop_();_nop_();_nop_();_nop_();		
    }
    while ( n--);      	
}

//
void I2CStart( void )
{
    sda = 1;
    scl = 1;
	I2C_Delay( DELAY_TIME );
    sda = 0;
	I2C_Delay( DELAY_TIME );
    scl = 0;    
}

//
void I2CStop( void )
{
    sda = 0;
    scl = 1;
	I2C_Delay( DELAY_TIME );
    sda = 1;
	I2C_Delay( DELAY_TIME );
}

//
void I2CSendByte( unsigned char byt )
{
    unsigned char i;
	
    for ( i = ; i < ; i++){
        scl = 0;
		I2C_Delay( DELAY_TIME );
        if ( byt & 0x80 ){
            sda = 1;
        }
        else{
            sda = 0;
        }
		I2C_Delay( DELAY_TIME );
        scl = 1;
        byt <<= 1;
		I2C_Delay( DELAY_TIME );
    }
	
    scl = 0;  
}

//
unsigned char I2CReceiveByte( void )
{
	unsigned char da;
	unsigned char i;
	for ( i = ;i < ;i++){   
		scl = 1;
		I2C_Delay( DELAY_TIME );
		da <<= 1;
		if ( sda ) 
			da |= 0x01;
		scl = 0;
		I2C_Delay( DELAY_TIME );
	}
	return da;    
}

//
unsigned char I2CWaitAck( void )
{
	unsigned char ackbit;
	
    scl = 1;
	I2C_Delay( DELAY_TIME );
    ackbit = sda; 
    scl = 0;
	I2C_Delay( DELAY_TIME );
	
	return ackbit;
}

//
void I2CSendAck( unsigned char ackbit )
{
    scl = 0;
    sda = ackbit; 
	I2C_Delay( DELAY_TIME );
    scl = 1;
	I2C_Delay( DELAY_TIME );
    scl = 0; 
	sda = 1;
	I2C_Delay( DELAY_TIME );
}

void Delay5ms( void )	//@12.000MHz
{
	unsigned char data i, j;

	i = 59;
	j = 90;
	do
	{
		while (--j );
	} while (--i );
}

//0 - 55 0x00 0xff
void AT24C02_Write( unsigned char *dat, unsigned char addr, unsigned char num )    //1.数据 2.地址 3.多少个数据
{
	I2CStart();
	I2CSendByte(0xa0 );
	I2CWaitAck();
	I2CSendByte( addr );
	I2CWaitAck();
	while ( num--)
	{
		I2CSendByte(*dat++);
		I2CWaitAck();
		I2C_Delay(200 );
	}
	I2CStop();
	Delay5ms();
}

void AT24C02_Read( unsigned char *dat, unsigned char addr, unsigned char num )
{
	I2CStart();
	I2CSendByte(0xa0 );
	I2CWaitAck();
	I2CSendByte( addr );
	I2CWaitAck();
	
	I2CStart();
	I2CSendByte(0xa1 );
	I2CWaitAck();
	while ( num--)
	{
		*dat++=I2CReceiveByte();
		if ( num )I2CSendAck(0 );
		else I2CSendAck(1 );
	}
	I2CStop();
}